{
  "story": "在森林边缘的一座古朴小屋里，住着一只聪明的小老鼠，名叫米洛。 老猫威斯克先生以严厉的爪子和警惕的眼光统治着这个家。 他的主要职责？守卫那块坐落于厨房木架顶上的轮状奶酪。 米洛早就渴望那块奶酪了。 那是最精致的切达奶酪，在午后阳光的照耀下闪耀着富丽的黄色，米洛几乎在梦中就能品尝到它的味道。 然而，由于威斯克先生的潜行，每次试图偷取一小块奶酪都以惊险的逃逸告终。 一天晚上，夕阳下沉，天边染上橙色和紫色，米洛想出了一个计划。 他知道自己必须比威斯克先生更聪明，而不是试图逃跑。 首先，他观察了猫咪的日常活动。 每晚黄昏过后，威斯克先生总是懒洋洋地躺在沙发上，奢侈地伸展身体，然后安稳地打个好盹。 米洛的出手时机到了。 米洛开始策划一个干扰计划。 他收集了一小片小纸屑，整晚不停地在房间的各个角落制造噪音。 每晚，威斯克先生在睡梦中被吵醒，迷迷糊糊地检查噪音来源，让奶酪暂时无人看管。 在米洛调皮捣蛋的第三个晚上，他注意到了一个关键的细节。 威斯克先生有一只最爱的毛绒老鼠玩具，他经常扑上去。 如果他能利用这个玩具来增强自己的计划，那计划可能就会成功。 米洛闪入玩具篮，抓住了那只毛绒老鼠，并将其拉进了一个角落。 他小心翼翼地拔出一些填充物，制作了一个迷你诱饵。 它是一个完美的自我复制品，只是稍微大一点，而且覆盖着绒毛。 夜幕降临时，米洛将诱饵放在房间的另一端。 他轻推了一下，让它看起来在移动。 随后，他躲在一壶茶后，心中充满期待。 果然，不久后，威斯克先生从睡梦中醒来，瞥见了那一动。 \"啊哈！\" 他想着，伸着懒腰，打了个哈欠， \"我家来了只老鼠！\" 威斯克先生敏捷迅速，朝诱饵扑去，速度让任何老鼠都感到心惊胆战。 但米洛早已计划得当。 当威斯克先生追逐那团毛绒球时，米洛抓住了机会。 他飞快穿过厨房的台面，眼中紧盯着奶酪。 当他到达架子时，图书馆的钟声在午夜敲响，带着优美的音色在房间内回荡。 这个时刻与威斯克先生抡打诱饵制造的骚动完美融合，令他觉得自己终于找到了晚餐的目标。 米洛迅速抓起一块切达奶酪，远比他预期的沉重，但美味得令人无法舍弃。 抓着奶酪，米洛急速往墙边跑去，正好看到威斯克先生意识到自己被骗了。 米洛及时回到了他的洞口，听到威斯克先生发出困惑的喵声，与他自己骄傲的吱吱声交融在一起。 \"你可以守住奶酪，但今晚我却要享用！\" 米洛骄傲地尖叫。 随着黎明的阳光洒入小屋，米洛品味着他渴望已久的奶酪的第一口。 这不仅仅是一顿饭，而是他机智的证明。 这块奶酪丰富美味，他情不自禁地微笑。 从那天起，米洛继续用他的聪明把玩奶酪的储藏，令威斯克先生苦恼不已，后者只能在一旁潜伏，眼睁睁地看着这只小老鼠成为小屋里生物中的传奇。",
  "title": "奶酪劫案",
  "sentences": [
    {
      "original": "在森林边缘的一座古朴小屋里，住着一只聪明的小老鼠，名叫米洛。",
      "translation": "In a quaint little cottage on the edge of the forest lived a clever little mouse named Milo."
    },
    {
      "original": "老猫威斯克先生以严厉的爪子和警惕的眼光统治着这个家。",
      "translation": "The old cat, Mr. Whiskers, ruled the house with his sharp claws and vigilant gaze."
    },
    {
      "original": "他的主要职责？守卫那块坐落于厨房木架顶上的轮状奶酪。",
      "translation": "His main duty? To guard the round cheese that was perched on top of the kitchen shelf."
    },
    {
      "original": "米洛早就渴望那块奶酪了。",
      "translation": "Milo had been longing for that cheese for a long time."
    },
    {
      "original": "那是最精致的切达奶酪，在午后阳光的照耀下闪耀着富丽的黄色，米洛几乎在梦中就能品尝到它的味道。",
      "translation": "It was the finest cheddar cheese, shining a luxurious yellow under the afternoon sun, and Milo could almost taste it in his dreams."
    },
    {
      "original": "然而，由于威斯克先生的潜行，每次试图偷取一小块奶酪都以惊险的逃逸告终。",
      "translation": "However, due to Mr. Whiskers' stealthy presence, each attempt to steal a small piece of cheese ended in a daring escape."
    },
    {
      "original": "一天晚上，夕阳下沉，天边染上橙色和紫色，米洛想出了一个计划。",
      "translation": "One evening, as the sun dipped down and the sky was painted in orange and purple, Milo came up with a plan."
    },
    {
      "original": "他知道自己必须比威斯克先生更聪明，而不是试图逃跑。",
      "translation": "He knew he had to be smarter than Mr. Whiskers, rather than trying to escape."
    },
    {
      "original": "首先，他观察了猫咪的日常活动。",
      "translation": "First, he observed the cat's daily activities."
    },
    {
      "original": "每晚黄昏过后，威斯克先生总是懒洋洋地躺在沙发上，奢侈地伸展身体，然后安稳地打个好盹。",
      "translation": "Every evening after dusk, Mr. Whiskers would lazily lie on the couch, stretching luxuriously, and then settle down for a nice nap."
    },
    {
      "original": "米洛的出手时机到了。",
      "translation": "It was time for Milo to make his move."
    },
    {
      "original": "米洛开始策划一个干扰计划。",
      "translation": "Milo began to scheme a distraction plan."
    },
    {
      "original": "他收集了一小片小纸屑，整晚不停地在房间的各个角落制造噪音。",
      "translation": "He collected small scraps of paper and made noise all night, scattering them around the room."
    },
    {
      "original": "每晚，威斯克先生在睡梦中被吵醒，迷迷糊糊地检查噪音来源，让奶酪暂时无人看管。",
      "translation": "Every night, Mr. Whiskers was awakened from his sleep, groggily checking the source of the noise, leaving the cheese temporarily unguarded."
    },
    {
      "original": "在米洛调皮捣蛋的第三个晚上，他注意到了一个关键的细节。",
      "translation": "On the third night of Milo's mischief, he noticed a crucial detail."
    },
    {
      "original": "威斯克先生有一只最爱的毛绒老鼠玩具，他经常扑上去。",
      "translation": "Mr. Whiskers had a favorite plush mouse toy that he often pounced on."
    },
    {
      "original": "如果他能利用这个玩具来增强自己的计划，那计划可能就会成功。",
      "translation": "If he could use this toy to enhance his plan, it might just succeed."
    },
    {
      "original": "米洛闪入玩具篮，抓住了那只毛绒老鼠，并将其拉进了一个角落。",
      "translation": "Milo darted into the toy basket, grabbed the plush mouse, and pulled it into a corner."
    },
    {
      "original": "他小心翼翼地拔出一些填充物，制作了一个迷你诱饵。",
      "translation": "He carefully pulled out some stuffing and made a mini decoy."
    },
    {
      "original": "它是一个完美的自我复制品，只是稍微大一点，而且覆盖着绒毛。",
      "translation": "It was a perfect replica, just slightly larger and covered in fur."
    },
    {
      "original": "夜幕降临时，米洛将诱饵放在房间的另一端。",
      "translation": "As night fell, Milo placed the decoy at the opposite end of the room."
    },
    {
      "original": "他轻推了一下，让它看起来在移动。",
      "translation": "He gave it a gentle push to make it appear as if it were moving."
    },
    {
      "original": "随后，他躲在一壶茶后，心中充满期待。",
      "translation": "Then, he hid behind a teapot, filled with anticipation."
    },
    {
      "original": "果然，不久后，威斯克先生从睡梦中醒来，瞥见了那一动。",
      "translation": "Sure enough, not long after, Mr. Whiskers woke from his slumber and caught sight of the movement."
    },
    {
      "original": "\"啊哈！\" 他想着，伸着懒腰，打了个哈欠， \"我家来了只老鼠！\"",
      "translation": "\"Aha!\" he thought as he stretched and yawned, \"A mouse has come to my house!\""
    },
    {
      "original": "威斯克先生敏捷迅速，朝诱饵扑去，速度让任何老鼠都感到心惊胆战。",
      "translation": "Mr. Whiskers was swift and agile, pouncing towards the decoy with a speed that would frighten any mouse."
    },
    {
      "original": "但米洛早已计划得当。",
      "translation": "But Milo had already planned accordingly."
    },
    {
      "original": "当威斯克先生追逐那团毛绒球时，米洛抓住了机会。",
      "translation": "As Mr. Whiskers chased the fluffy ball, Milo seized the opportunity."
    },
    {
      "original": "他飞快穿过厨房的台面，眼中紧盯着奶酪。",
      "translation": "He zipped across the kitchen countertop, his eyes fixed on the cheese."
    },
    {
      "original": "当他到达架子时，图书馆的钟声在午夜敲响，带着优美的音色在房间内回荡。",
      "translation": "When he reached the shelf, the clock in the library chimed midnight, its melodious tones resonating in the room."
    },
    {
      "original": "这个时刻与威斯克先生抡打诱饵制造的骚动完美融合，令他觉得自己终于找到了晚餐的目标。",
      "translation": "This moment perfectly coincided with the commotion created by Mr. Whiskers batting at the decoy, making him feel he had finally found his dinner target."
    },
    {
      "original": "米洛迅速抓起一块切达奶酪，远比他预期的沉重，但美味得令人无法舍弃。",
      "translation": "Milo quickly snatched up a piece of cheddar cheese, far heavier than he expected, but too delicious to resist."
    },
    {
      "original": "抓着奶酪，米洛急速往墙边跑去，正好看到威斯克先生意识到自己被骗了。",
      "translation": "Holding the cheese, Milo darted towards the wall, just in time to see Mr. Whiskers realize he had been tricked."
    },
    {
      "original": "米洛及时回到了他的洞口，听到威斯克先生发出困惑的喵声，与他自己骄傲的吱吱声交融在一起。",
      "translation": "Milo made it back to his hole just in time, hearing Mr. Whiskers' confused meow blend with his own proud squeaks."
    },
    {
      "original": "\"你可以守住奶酪，但今晚我却要享用！\" 米洛骄傲地尖叫。",
      "translation": "\"You can guard the cheese, but tonight it's mine!\" Milo crowed proudly."
    },
    {
      "original": "随着黎明的阳光洒入小屋，米洛品味着他渴望已久的奶酪的第一口。",
      "translation": "As the dawn sunlight spilled into the cottage, Milo savored the first taste of the cheese he had longed for."
    },
    {
      "original": "这不仅仅是一顿饭，而是他机智的证明。",
      "translation": "It was not just a meal, but a testament to his cleverness."
    },
    {
      "original": "这块奶酪丰富美味，他情不自禁地微笑。",
      "translation": "The cheese was rich and delicious, and he couldn't help but smile."
    },
    {
      "original": "从那天起，米洛继续用他的聪明把玩奶酪的储藏，令威斯克先生苦恼不已，后者只能在一旁潜伏，眼睁睁地看着这只小老鼠成为小屋里生物中的传奇。",
      "translation": "From that day on, Milo continued to play smart with the cheese stash, leaving Mr. Whiskers distressed, who could only lurk nearby, watching this little mouse become a legend among the creatures in the cottage."
    }
  ],
  "words": [
    [
      {
        "word": "在",
        "translation": "at - 在 zai4 (at, in)",
        "explanation": "This word indicates location or position."
      },
      {
        "word": "森林",
        "translation": "forest - 森林 sen1 lin2 (forest, woods)",
        "explanation": "This is a large area filled with trees."
      },
      {
        "word": "边缘",
        "translation": "edge - 边缘 bian1 yuan2 (edge, border)",
        "explanation": "This refers to the outer limit or boundary."
      },
      {
        "word": "一座",
        "translation": "a - 一座 yi1 zuo4 (one, a structure)",
        "explanation": "This is a measure word used for buildings."
      },
      {
        "word": "古朴",
        "translation": "rustic - 古朴 gu3 pu3 (ancient, simple)",
        "explanation": "This describes something that is old-fashioned and traditional."
      },
      {
        "word": "小屋",
        "translation": "cottage - 小屋 xiao3 wu1 (small room, cottage)",
        "explanation": "This is a small, simple house."
      },
      {
        "word": "里",
        "translation": "inside - 里 li3 (inside)",
        "explanation": "This indicates the location being within something."
      },
      {
        "word": "住着",
        "translation": "lives - 住 zhu4 (to live), 着 zhe (indicates ongoing status)",
        "explanation": "This shows that someone resides in a place."
      },
      {
        "word": "一只",
        "translation": "a - 一只 yi1 zhi1 (one, a unit for animals)",
        "explanation": "This is a measure word used for certain animals."
      },
      {
        "word": "聪明",
        "translation": "smart - 聪明 cong1 ming2 (intelligent, clever)",
        "explanation": "This describes someone who is wise or quick-witted."
      },
      {
        "word": "的小老鼠",
        "translation": "little mouse - 小老鼠 xiao3 lao3 shu3 (small rodent)",
        "explanation": "This refers to a small rodent character."
      },
      {
        "word": "名叫",
        "translation": "named - 名叫 ming2 jiao4 (to be named)",
        "explanation": "This indicates the name of someone or something."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3 Luo4 (a name)",
        "explanation": "This is the proper name of the mouse."
      }
    ],
    [
      {
        "word": "老猫",
        "translation": "old cat - 老猫 lao3 mao1 (elderly feline)",
        "explanation": "This refers to an adult cat."
      },
      {
        "word": "威斯克先生",
        "translation": "Mr. Whiskers - 威斯克先生 Wei1 si1 ke4 xian1 sheng1 (Mr. Whiskers)",
        "explanation": "This is the character's name."
      },
      {
        "word": "以",
        "translation": "with - 以 yi3 (with, by)",
        "explanation": "This word introduces the means or way something is done."
      },
      {
        "word": "严厉",
        "translation": "stern - 严厉 yan2 li4 (strict, harsh)",
        "explanation": "This describes someone who is very serious or strict."
      },
      {
        "word": "的",
        "translation": "(possessive/attributive particle) - 的 de (indicates possession)",
        "explanation": "This links the previous description to the subject."
      },
      {
        "word": "爪子",
        "translation": "claws - 爪子 zhua3 zi (claws, nails)",
        "explanation": "This refers to the sharp extensions on a cat's paws."
      },
      {
        "word": "和",
        "translation": "and - 和 he2 (and, with)",
        "explanation": "This word is used to connect words or phrases."
      },
      {
        "word": "警惕",
        "translation": "alert - 警惕 jing3 ti4 (vigilant, cautious)",
        "explanation": "This means being watchful or careful."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de",
        "explanation": "This links the description to the subject."
      },
      {
        "word": "眼光",
        "translation": "eyes - 眼光 yan3 guang1 (vision, sight)",
        "explanation": "This refers to how someone looks or observes."
      },
      {
        "word": "统治着",
        "translation": "rules - 统治 tong3 zhi4 (to rule, to dominate), 着 zhe (ongoing status)",
        "explanation": "This indicates the action of having control or authority."
      },
      {
        "word": "这个",
        "translation": "this - 这个 zhe4 ge (this one)",
        "explanation": "This points to something specific."
      },
      {
        "word": "家",
        "translation": "home - 家 jia1 (home, family)",
        "explanation": "This refers to the place where someone lives."
      }
    ],
    [
      {
        "word": "他的",
        "translation": "his - 他的 ta1 de (belonging to him)",
        "explanation": "This indicates possession."
      },
      {
        "word": "主要",
        "translation": "main - 主要 zhu3 yao4 (primary, most important)",
        "explanation": "This describes something that is the most significant."
      },
      {
        "word": "职责",
        "translation": "responsibility - 职责 zhi2 ze2 (duty, role)",
        "explanation": "This refers to a person's duty or task."
      },
      {
        "word": "？",
        "translation": "? - ? (question mark)",
        "explanation": "This indicates a question."
      }
    ],
    [
      {
        "word": "守卫",
        "translation": "guard - 守卫 shou3 wei4 (to protect, to guard)",
        "explanation": "This means to watch over or protect."
      },
      {
        "word": "那块",
        "translation": "that piece - 那块 na4 kuai4 (that piece)",
        "explanation": "This refers to a specific item."
      },
      {
        "word": "坐落于",
        "translation": "located at - 坐落于 zuo4 luo4 yu2 (situated in)",
        "explanation": "This describes where something is placed."
      },
      {
        "word": "厨房",
        "translation": "kitchen - 厨房 chu2 fang2 (cooking room)",
        "explanation": "This is the room where food is prepared."
      },
      {
        "word": "木架",
        "translation": "wooden rack - 木架 mu4 jia4 (wooden structure)",
        "explanation": "This refers to a framework made of wood."
      },
      {
        "word": "顶上",
        "translation": "on top - 顶上 ding3 shang4 (on the top)",
        "explanation": "This indicates a position at the highest point."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de",
        "explanation": "This links the description to the noun."
      },
      {
        "word": "轮状奶酪",
        "translation": "wheeled cheese - 轮状奶酪 lun2 zhuang4 nai3 lao4 (circular cheese)",
        "explanation": "This refers to cheese that is shaped like a wheel."
      },
      {
        "word": "。",
        "translation": ". - . (period)",
        "explanation": "This indicates the end of a sentence."
      }
    ],
    [
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3 Luo4 (a name)",
        "explanation": "This is the name of the mouse."
      },
      {
        "word": "早就",
        "translation": "long ago - 早就 zao3 jiu4 (already, a long time ago)",
        "explanation": "This indicates something happened a long time in the past."
      },
      {
        "word": "渴望",
        "translation": "craved - 渴望 ke3 wang4 (to desire, to yearn for)",
        "explanation": "This means to strongly wish for something."
      },
      {
        "word": "那块",
        "translation": "that piece - 那块 na4 kuai4 (that piece)",
        "explanation": "This refers to a specific item."
      },
      {
        "word": "奶酪了",
        "translation": "cheese - 奶酪 nai3 lao4 (dairy product)",
        "explanation": "This refers to cheese."
      }
    ],
    [
      {
        "word": "那是",
        "translation": "that is - 那是 na4 shi4 (that is)",
        "explanation": "This indicates something being identified."
      },
      {
        "word": "最精致的",
        "translation": "the most exquisite - 最精致的 zui4 jing1 zhi4 de (the most delicate)",
        "explanation": "This describes something that is very finely made."
      },
      {
        "word": "切达奶酪",
        "translation": "cheddar cheese - 切达奶酪 qie1 da2 nai3 lao4 (specific type of cheese)",
        "explanation": "This refers to a specific type of cheese."
      },
      {
        "word": "，",
        "translation": ", - , (comma)",
        "explanation": "This indicates a pause in the sentence."
      },
      {
        "word": "在",
        "translation": "in - 在 zai4 (in, at)",
        "explanation": "This indicates location."
      },
      {
        "word": "午后",
        "translation": "afternoon - 午后 wu3 hou4 (after noon)",
        "explanation": "This refers to the time of day after midday."
      },
      {
        "word": "阳光",
        "translation": "sunlight - 阳光 yang2 guang1 (sunlight, sunshine)",
        "explanation": "This refers to the light from the sun."
      },
      {
        "word": "的照耀下",
        "translation": "under the shine - 的照耀下 de zhao4 yao4 xia4 (under the light)",
        "explanation": "This describes being illuminated."
      },
      {
        "word": "闪耀着",
        "translation": "shines - 闪耀 zhan3 yao4 (to shine) 着 zhe (ongoing status)",
        "explanation": "This indicates something is currently shining."
      },
      {
        "word": "富丽的",
        "translation": "gorgeous - 富丽的 fu4 li4 de (richly beautiful)",
        "explanation": "This describes something that is very beautiful or splendid."
      },
      {
        "word": "黄色",
        "translation": "yellow - 黄色 huang2 se4 (color yellow)",
        "explanation": "This describes the color of something."
      },
      {
        "word": "，",
        "translation": ", - , (comma)",
        "explanation": "This indicates a pause in the sentence."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3 Luo4 (a name)",
        "explanation": "This is the name of the mouse."
      },
      {
        "word": "几乎",
        "translation": "almost - 几乎 ji1 hu1 (nearly, practically)",
        "explanation": "This indicates something is very close to happening."
      },
      {
        "word": "在梦中",
        "translation": "in a dream - 在梦中 zai4 meng4 zhong1 (inside a dream)",
        "explanation": "This describes being in a state of dreaming."
      },
      {
        "word": "就能",
        "translation": "can - 就能 jiu4 neng2 (will be able to)",
        "explanation": "This indicates capability."
      },
      {
        "word": "品尝到",
        "translation": "taste - 品尝到 pin3 chang2 dao4 (to taste)",
        "explanation": "This refers to the act of trying food."
      },
      {
        "word": "它的",
        "translation": "its - 它的 ta1 de (belonging to it)",
        "explanation": "This indicates possession."
      },
      {
        "word": "味道。",
        "translation": "taste. - 味道 wei4 dao4 (the flavor)",
        "explanation": "This refers to the flavor of something."
      }
    ],
    [
      {
        "word": "然而",
        "translation": "however - 然 ran2 (this) 而 er2 (and)",
        "explanation": "This word shows contrast."
      },
      {
        "word": "由于",
        "translation": "due to - 由 you2 (from) 于 yu2 (at)",
        "explanation": "This word indicates a reason."
      },
      {
        "word": "威斯克",
        "translation": "Mr. Wisk - 威 wei1 (power) 斯 si1 (this) 克 ke4 (overcome)",
        "explanation": "This is a person's name."
      },
      {
        "word": "先生",
        "translation": "Mr - 先 xian1 (first) 生 sheng1 (born)",
        "explanation": "This is a respectful title for a man."
      },
      {
        "word": "的",
        "translation": "(of) - 的 de (possessive or descriptive particle)",
        "explanation": "Indicates possession."
      },
      {
        "word": "潜行",
        "translation": "stealth - 潜 qian2 (to hide) 行 xing2 (to walk)",
        "explanation": "This means moving quietly or secretly."
      },
      {
        "word": "每次",
        "translation": "every time - 每 mei3 (every) 次 ci4 (time)",
        "explanation": "Refers to each instance."
      },
      {
        "word": "尝试",
        "translation": "to try - 尝 chang2 (to taste) 试 shi4 (to test)",
        "explanation": "This means making an attempt."
      },
      {
        "word": "偷取",
        "translation": "to steal - 偷 tou1 (to steal) 取 qu3 (to take)",
        "explanation": "This means taking something without permission."
      },
      {
        "word": "一小块",
        "translation": "a small piece - 一 yi1 (one) 小 xiao3 (small) 块 kuai4 (piece)",
        "explanation": "Describes a small amount."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶 nai3 (milk) 酪 lao4 (curd)",
        "explanation": "This refers to dairy food."
      },
      {
        "word": "都",
        "translation": "all - 都 dou1 (all)",
        "explanation": "Indicates totality."
      },
      {
        "word": "以",
        "translation": "with - 以 yi3 (to use)",
        "explanation": "This indicates using something."
      },
      {
        "word": "惊险",
        "translation": "thrilling - 惊 jing1 (to surprise) 險 xian3 (danger)",
        "explanation": "Describes a situation that is exciting and risky."
      },
      {
        "word": "的",
        "translation": "(of) - 的 de (possessive or descriptive particle)",
        "explanation": "Indicates possession."
      },
      {
        "word": "逃逸",
        "translation": "escape - 逃 tao2 (to escape) 逸 yi4 (to slip away)",
        "explanation": "This means getting away from danger."
      },
      {
        "word": "告终",
        "translation": "ends - 告 gao4 (to inform) 终 zhong1 (end)",
        "explanation": "Means to finish or conclude."
      }
    ],
    [
      {
        "word": "一天",
        "translation": "one day - 一 yi1 (one) 天 tian1 (day)",
        "explanation": "Refers to a single day."
      },
      {
        "word": "晚上",
        "translation": "evening - 晚 wan3 (evening) 上 shang4 (on)",
        "explanation": "Refers to the time after sunset."
      },
      {
        "word": "夕阳",
        "translation": "sunset - 夕 xi1 (evening) 阳 yang2 (sun)",
        "explanation": "The sun setting in the evening."
      },
      {
        "word": "下沉",
        "translation": "sinks - 下 xia4 (down) 沉 chen2 (to sink)",
        "explanation": "Describes the sun going lower in the sky."
      },
      {
        "word": "天边",
        "translation": "horizon - 天 tian1 (sky) 边 bian1 (edge)",
        "explanation": "Where the sky meets the ground."
      },
      {
        "word": "染上",
        "translation": "colored - 染 ran3 (to dye) 上 shang4 (on)",
        "explanation": "Means to take on a color."
      },
      {
        "word": "橙色",
        "translation": "orange - 橙 cheng2 (orange) 色 se4 (color)",
        "explanation": "This describes a specific color."
      },
      {
        "word": "和",
        "translation": "and - 和 he2 (and)",
        "explanation": "Used to connect words together."
      },
      {
        "word": "紫色",
        "translation": "purple - 紫 zi3 (purple) 色 se4 (color)",
        "explanation": "This describes another specific color."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米 mi3 (rice) 洛 luo4 (to fall)",
        "explanation": "This is a person's name."
      },
      {
        "word": "想出了",
        "translation": "came up with - 想 xiang3 (to think) 出 chu1 (to come out) 了 le0 (particle)",
        "explanation": "Means to create an idea."
      },
      {
        "word": "一个",
        "translation": "a - 一个 yi1 ge4 (one unit)",
        "explanation": "Indicates a single item."
      },
      {
        "word": "计划",
        "translation": "plan - 计划 ji4 hua4 (plan)",
        "explanation": "This refers to a method of doing something."
      }
    ],
    [
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "Refers to a male person."
      },
      {
        "word": "知道",
        "translation": "knows - 知 zhi1 (to know) 道 dao4 (way)",
        "explanation": "Means to have information."
      },
      {
        "word": "自己",
        "translation": "himself - 自 zi4 (self) 己 ji3 (oneself)",
        "explanation": "Refers to the person themselves."
      },
      {
        "word": "必须",
        "translation": "must - 必 bi4 (must) 须 xu1 (to need)",
        "explanation": "Indicates necessity."
      },
      {
        "word": "比",
        "translation": "than - 比 bi3 (compared to)",
        "explanation": "Used for comparison."
      },
      {
        "word": "威斯克先生",
        "translation": "Mr. Wisk - 威 wei1 (power) 斯 si1 (this) 克 ke4 (overcome) 先 xian1 (first) 生 sheng1 (born)",
        "explanation": "Refers to the same person's name."
      },
      {
        "word": "更",
        "translation": "more - 更 geng1 (more)",
        "explanation": "Indicates a greater degree."
      },
      {
        "word": "聪明",
        "translation": "smart - 聪 cong1 (intelligent) 明 ming2 (bright)",
        "explanation": "Describes being intelligent."
      },
      {
        "word": "而不是",
        "translation": "and not - 而 er2 (and) 不是 bu4 shi4 (not is)",
        "explanation": "Indicates a different choice."
      },
      {
        "word": "试图",
        "translation": "to attempt - 试 shi4 (to try) 图 tu2 (to plan)",
        "explanation": "Means to make an effort."
      },
      {
        "word": "逃跑",
        "translation": "to escape - 逃 tao2 (to escape) 跑 pao3 (to run)",
        "explanation": "Means to run away."
      }
    ],
    [
      {
        "word": "首先",
        "translation": "first - 首 shou3 (head) 先 xian1 (first)",
        "explanation": "Indicates the first step."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "Refers to a male person."
      },
      {
        "word": "观察了",
        "translation": "observed - 观察 guan1 cha2 (to observe) 了 le0 (completed action)",
        "explanation": "Means to closely watch."
      },
      {
        "word": "猫咪",
        "translation": "cats - 猫 mao1 (cat) 咪 mi1 (mew)",
        "explanation": "Refers to felines,"
      },
      {
        "word": "的",
        "translation": "(of) - 的 de (possessive or descriptive particle)",
        "explanation": "Indicates possession."
      },
      {
        "word": "日常",
        "translation": "daily - 日 ri4 (day) 常 chang2 (usual)",
        "explanation": "Refers to routine activities."
      },
      {
        "word": "活动",
        "translation": "activities - 活动 huo2 dong4 (activities)",
        "explanation": "Refers to actions or events."
      }
    ],
    [
      {
        "word": "每晚",
        "translation": "every night - 每 mei3 (every) 晚 wan3 (night)",
        "explanation": "Refers to each night."
      },
      {
        "word": "黄昏",
        "translation": "dusk - 黄 huang2 (yellow) 昏 hun1 (to dim)",
        "explanation": "The time just after sunset."
      },
      {
        "word": "过后",
        "translation": "after - 过 guo4 (to pass) 后 hou4 (after)",
        "explanation": "Indicates something happening afterward."
      },
      {
        "word": "威斯克先生",
        "translation": "Mr. Wisk - 威 wei1 (power) 斯 si1 (this) 克 ke4 (overcome) 先 xian1 (first) 生 sheng1 (born)",
        "explanation": "Refers to the same person's name."
      },
      {
        "word": "总是",
        "translation": "always - 总是 zong3 shi4 (always)",
        "explanation": "Means at all times."
      },
      {
        "word": "懒洋洋地",
        "translation": "lazily - 懒 lan3 (lazy) 洋洋 yang2 (lazy actions) 地 de (adverbial particle)",
        "explanation": "Describes a lazy manner."
      },
      {
        "word": "躺在",
        "translation": "lying on - 躺 tang3 (to lie) 在 zai4 (to be at)",
        "explanation": "Means resting on a surface."
      },
      {
        "word": "沙发上",
        "translation": "the sofa - 沙发 sha1 fa1 (sofa) 上 shang4 (on)",
        "explanation": "Refers to lying on a piece of furniture."
      },
      {
        "word": "奢侈地",
        "translation": "luxuriously - 奢侈 she1 chi3 (luxurious) 地 de (adverbial particle)",
        "explanation": "Describes an extravagant manner."
      },
      {
        "word": "伸展",
        "translation": "stretch - 伸 shen1 (to extend) 展 zhan3 (to unfold)",
        "explanation": "Means to extend one's body."
      },
      {
        "word": "身体",
        "translation": "body - 身 shin1 (body) 体 ti3 (form)",
        "explanation": "Refers to the physical form."
      },
      {
        "word": "然后",
        "translation": "then - 然后 ran2 hou4 (after that)",
        "explanation": "Indicates the next action."
      },
      {
        "word": "安稳地",
        "translation": "securely - 安稳 an1 wen3 (secure) 地 de (adverbial particle)",
        "explanation": "Means to do something in a stable way."
      },
      {
        "word": "打个",
        "translation": "take a - 打 da3 (to hit) 个 ge4 (a unit)",
        "explanation": "Refers to doing something briefly."
      },
      {
        "word": "好盹",
        "translation": "good nap - 好 hao3 (good) 盹 dun3 (nap)",
        "explanation": "Means a short sleep."
      }
    ],
    [
      {
        "word": "米洛",
        "translation": "Milo - 米 mi3 (rice) 洛 luo4 (to approach)",
        "explanation": "Milo is the name of a character."
      },
      {
        "word": "的",
        "translation": "of - 的 de5 (possessive particle)",
        "explanation": "This character shows possession or relationship."
      },
      {
        "word": "出手",
        "translation": "strike - 出手 chu1 shou3 (to extend hand)",
        "explanation": "This means Milo's action of starting."
      },
      {
        "word": "时机",
        "translation": "timing - 时机 shi2 ji1 (time opportunity)",
        "explanation": "This is the right moment for Milo to act."
      },
      {
        "word": "到了",
        "translation": "arrived - 到了 dao4 le5 (to arrive)",
        "explanation": "This means that the moment has come."
      }
    ],
    [
      {
        "word": "米洛",
        "translation": "Milo - 米 mi3 (rice) 洛 luo4 (to approach)",
        "explanation": "Milo is the character's name."
      },
      {
        "word": "开始",
        "translation": "began - 开始 kai1 shi3 (to start)",
        "explanation": "This means Milo started doing something."
      },
      {
        "word": "策划",
        "translation": "planning - 策划 ce4 hua4 (planning)",
        "explanation": "This means Milo is making a plan."
      },
      {
        "word": "一个",
        "translation": "a - 一个 yi1 ge4 (one)",
        "explanation": "This indicates one plan."
      },
      {
        "word": "干扰",
        "translation": "interference - 干扰 gan1 rao3 (to disturb)",
        "explanation": "This means the plan is meant to disrupt."
      },
      {
        "word": "计划",
        "translation": "plan - 计划 ji4 hua4 (to plan)",
        "explanation": "This is the actual plan Milo is creating."
      }
    ],
    [
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "This refers to Milo."
      },
      {
        "word": "收集",
        "translation": "collected - 收集 shou1 ji2 (to gather)",
        "explanation": "This means he gathered something."
      },
      {
        "word": "了",
        "translation": "(past tense) - 了 le5 (completed action)",
        "explanation": "This shows that the action is finished."
      },
      {
        "word": "一小片",
        "translation": "a small piece - 一小片 yi1 xiao3 pian4 (a small slice)",
        "explanation": "This indicates a tiny amount."
      },
      {
        "word": "小纸屑",
        "translation": "paper scraps - 小纸屑 xiao3 zhi3 xie4 (small paper pieces)",
        "explanation": "These are the scraps collected by Milo."
      },
      {
        "word": "整晚",
        "translation": "all night - 整晚 zheng3 wan3 (the whole night)",
        "explanation": "This describes the duration of the action."
      },
      {
        "word": "不停地",
        "translation": "constantly - 不停地 bu4 ting2 de5 (nonstop)",
        "explanation": "This means he did it without stopping."
      },
      {
        "word": "在",
        "translation": "in - 在 zai4 (in/at/on)",
        "explanation": "This shows the location of the actions."
      },
      {
        "word": "房间",
        "translation": "room - 房间 fang2 jian1 (the room)",
        "explanation": "This is where the noise was made."
      },
      {
        "word": "的",
        "translation": "of - 的 de5 (possessive particle)",
        "explanation": "Indicates possession."
      },
      {
        "word": "各个",
        "translation": "various - 各个 ge4 ge4 (each and every)",
        "explanation": "This refers to different places."
      },
      {
        "word": "角落",
        "translation": "corners - 角落 jiao3 luo4 (angles/edges)",
        "explanation": "This describes different parts of the room."
      },
      {
        "word": "制造",
        "translation": "create - 制造 zhi4 zao4 (to make)",
        "explanation": "This means to produce or generate something."
      },
      {
        "word": "噪音",
        "translation": "noise - 噪音 zao4 yin1 (disturbing sound)",
        "explanation": "This is the sound that was generated."
      }
    ],
    [
      {
        "word": "每晚",
        "translation": "every night - 每晚 mei3 wan3 (each night)",
        "explanation": "This describes the frequency of the action."
      },
      {
        "word": "威斯克",
        "translation": "Mr. Wesker - 威斯克 wei1 si1 ke1 (Wesker's name)",
        "explanation": "This is the name of a character."
      },
      {
        "word": "在",
        "translation": "in - 在 zai4 (in/at/on)",
        "explanation": "This shows where the action takes place."
      },
      {
        "word": "睡梦中",
        "translation": "in sleep - 睡梦中 shui4 meng4 zhong1 (during dream)",
        "explanation": "This means indicates he is sleeping."
      },
      {
        "word": "被",
        "translation": "was - 被 bei4 (passive marker)",
        "explanation": "This indicates that something was done to him."
      },
      {
        "word": "吵醒",
        "translation": "woken - 吵醒 chao3 xing3 (awoken by noise)",
        "explanation": "This means to be disturbed from sleep."
      },
      {
        "word": "迷迷糊糊地",
        "translation": "groggily - 迷迷糊糊地 mi2 mi2 hu2 hu2 de5 (dazed)",
        "explanation": "This describes how Mr. Wesker was feeling."
      },
      {
        "word": "检查",
        "translation": "check - 检查 jian3 cha2 (to inspect)",
        "explanation": "This means to look for something."
      },
      {
        "word": "噪音",
        "translation": "noise - 噪音 zao4 yin1 (disturbing sound)",
        "explanation": "This is the sound that woke him."
      },
      {
        "word": "来源",
        "translation": "source - 来源 lai2 yuán2 (place of coming)",
        "explanation": "This is where the noise came from."
      },
      {
        "word": "让",
        "translation": "let - 让 rang4 (to allow)",
        "explanation": "This means to permit something."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶酪 nai3 lao4 (milk curd)",
        "explanation": "This is the food item being watched."
      },
      {
        "word": "暂时",
        "translation": "temporarily - 暂时 zan4 shi2 (for a short time)",
        "explanation": "This means for a little period."
      },
      {
        "word": "无人",
        "translation": "nobody - 无人 wu2 ren2 (no person)",
        "explanation": "This means no one was watching."
      },
      {
        "word": "看管",
        "translation": "look after - 看管 kan4 guan3 (to supervise)",
        "explanation": "This means to keep an eye on."
      }
    ],
    [
      {
        "word": "在",
        "translation": "on - 在 zai4 (in/at/on)",
        "explanation": "This shows the context."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米 mi3 (rice) 洛 luo4 (to approach)",
        "explanation": "Milo is the character's name."
      },
      {
        "word": "调皮捣蛋",
        "translation": "mischievous - 调皮捣蛋 tiao2 pi2 dao3 dan4 (to be naughty)",
        "explanation": "This describes Milo's behavior."
      },
      {
        "word": "的",
        "translation": "(possessive) - 的 de5 (possessive particle)",
        "explanation": "Shows possession."
      },
      {
        "word": "第三个",
        "translation": "third - 第三个 di4 san1 ge4 (the third one)",
        "explanation": "This shows the order of the night."
      },
      {
        "word": "晚上",
        "translation": "night - 晚上 wan3 shang4 (evening)",
        "explanation": "This is the time of day."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "This refers to Milo."
      },
      {
        "word": "注意到",
        "translation": "noticed - 注意到 zhu4 yi4 dao4 (to pay attention)",
        "explanation": "This means he became aware of something."
      },
      {
        "word": "一个",
        "translation": "a - 一个 yi1 ge4 (one)",
        "explanation": "This indicates one detail."
      },
      {
        "word": "关键",
        "translation": "key - 关键 guan1 jian4 (important point)",
        "explanation": "This means an important piece."
      },
      {
        "word": "的",
        "translation": "(possessive) - 的 de5 (possessive particle)",
        "explanation": "Indicates ownership."
      },
      {
        "word": "细节",
        "translation": "detail - 细节 xi4 jie2 (small point)",
        "explanation": "This refers to a small but important point."
      }
    ],
    [
      {
        "word": "威斯克",
        "translation": "Mr. Whisk - 威 wei1 (power) 斯 si1 (this) 克 ke4 (overcome)",
        "explanation": "This is the name of a character, Mr. Whisk."
      },
      {
        "word": "先生",
        "translation": "Mr. - 先 xian1 (first) 生 sheng1 (born)",
        "explanation": "This is a title used to refer to a man politely."
      },
      {
        "word": "有",
        "translation": "has - 有 you3 (have)",
        "explanation": "This word indicates possession."
      },
      {
        "word": "一只",
        "translation": "a - 一 yi1 (one) 只 zhi1 (measure word for animals)",
        "explanation": "This is a classifier used for one piece of something."
      },
      {
        "word": "最",
        "translation": "most - 最 zui4 (most)",
        "explanation": "This word indicates the highest degree."
      },
      {
        "word": "爱",
        "translation": "favorite - 爱 ai4 (love)",
        "explanation": "This word shows strong affection."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de5 (of)",
        "explanation": "This combines with nouns to show possession."
      },
      {
        "word": "毛绒",
        "translation": "plush - 毛 mao2 (fur) 绒 rong2 (fluff)",
        "explanation": "This describes something soft and furry."
      },
      {
        "word": "老鼠",
        "translation": "mouse - 老 lao3 (old) 鼠 shu3 (rat)",
        "explanation": "This is a small rodent."
      },
      {
        "word": "玩具",
        "translation": "toy - 玩 wan2 (play) 具 ju4 (tools)",
        "explanation": "This is an object that children play with."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "This is a pronoun used to refer to Mr. Whisk."
      },
      {
        "word": "经常",
        "translation": "often - 经 jing1 (experience) 常 chang2 (often)",
        "explanation": "This word indicates frequency."
      },
      {
        "word": "扑上去",
        "translation": "pounces on - 扑 pu1 (pounce) 上 shang4 (up) 去 qu4 (go)",
        "explanation": "This describes an action of jumping onto something."
      }
    ],
    [
      {
        "word": "如果",
        "translation": "if - 如果 ru2 (if) 果 guo3 (fruit)",
        "explanation": "This introduces a condition."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "Refers to Mr. Whisk."
      },
      {
        "word": "能",
        "translation": "can - 能 neng2 (be able to)",
        "explanation": "This indicates ability."
      },
      {
        "word": "利用",
        "translation": "utilize - 利 li4 (benefit) 用 yong4 (use)",
        "explanation": "This means to make use of something."
      },
      {
        "word": "这个",
        "translation": "this - 这 zhe4 (this) 个 ge4 (measure word)",
        "explanation": "Indicates something close by."
      },
      {
        "word": "玩具",
        "translation": "toy - 玩 wan2 (play) 具 ju4 (tools)",
        "explanation": "Same as above, an object for play."
      },
      {
        "word": "来",
        "translation": "to - 来 lai2 (come)",
        "explanation": "This indicates direction or purpose."
      },
      {
        "word": "增强",
        "translation": "enhance - 增 zeng1 (increase) 强 qiang2 (strength)",
        "explanation": "This means to make stronger."
      },
      {
        "word": "自己",
        "translation": "his plans - 自 zi4 (self) 己 ji3 (oneself)",
        "explanation": "Refers to one's own."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de5 (of)",
        "explanation": "Shows possession."
      },
      {
        "word": "计划",
        "translation": "plans - 计划 ji4 hua4 (plan)",
        "explanation": "This refers to a series of actions or thoughts."
      },
      {
        "word": "那",
        "translation": "that - 那 na4 (that)",
        "explanation": "Indicates something further away."
      },
      {
        "word": "计划",
        "translation": "plans - 计划 ji4 hua4 (plan)",
        "explanation": "Same as above."
      },
      {
        "word": "可能",
        "translation": "may - 可 ke3 (can) 能 neng2 (be able to)",
        "explanation": "This indicates possibility."
      },
      {
        "word": "就",
        "translation": "then - 就 jiu4 (then)",
        "explanation": "A word that indicates a conclusion or result."
      },
      {
        "word": "会",
        "translation": "will - 会 hui4 (can)",
        "explanation": "Indicates future possibility or certainty."
      },
      {
        "word": "成功",
        "translation": "succeed - 成 cheng2 (become) 功 gong1 (achievement)",
        "explanation": "This word means to accomplish something."
      }
    ],
    [
      {
        "word": "米洛",
        "translation": "Milo - 米 mi3 (rice) 洛 luo4 (to fall)",
        "explanation": "This is the name of another character, Milo."
      },
      {
        "word": "闪入",
        "translation": "flashed into - 闪 shan3 (flash) 入 ru4 (enter)",
        "explanation": "This indicates a quick movement into something."
      },
      {
        "word": "玩具",
        "translation": "toy - 玩 wan2 (play) 具 ju4 (tools)",
        "explanation": "Same as above."
      },
      {
        "word": "篮",
        "translation": "basket - 篮 lan2 (basket)",
        "explanation": "This is a container for holding items."
      },
      {
        "word": "抓住",
        "translation": "grabbed - 抓 zhua1 (grab) 住 zhu4 (hold)",
        "explanation": "This describes the action of taking hold."
      },
      {
        "word": "了",
        "translation": "(completed action marker) - 了 le5 (completed)",
        "explanation": "This indicates an action has been completed."
      },
      {
        "word": "那只",
        "translation": "that - 那 na4 (that) 只 zhi1 (measure word for animals)",
        "explanation": "Refers to a specific item."
      },
      {
        "word": "毛绒",
        "translation": "plush - 毛 mao2 (fur) 绒 rong2 (fluff)",
        "explanation": "Same as above, describes something soft and furry."
      },
      {
        "word": "老鼠",
        "translation": "mouse - 老 lao3 (old) 鼠 shu3 (rat)",
        "explanation": "Same as above, a small rodent."
      },
      {
        "word": "并",
        "translation": "and - 并 bing4 (and)",
        "explanation": "This word connects clauses or phrases."
      },
      {
        "word": "将",
        "translation": "pulled - 将 jiang1 (to take)",
        "explanation": "This indicates an action of moving something."
      },
      {
        "word": "其",
        "translation": "it - 其 qi2 (its)",
        "explanation": "Refers to the toy."
      },
      {
        "word": "拉进",
        "translation": "pulled into - 拉 la1 (pull) 进 jin4 (enter)",
        "explanation": "This describes the action of bringing into."
      },
      {
        "word": "了",
        "translation": "(completed action marker) - 了 le5 (completed)",
        "explanation": "This indicates the action was finished."
      },
      {
        "word": "一个",
        "translation": "a - 一 yi1 (one) 个 ge4 (measure word)",
        "explanation": "This is a classifier for singular items."
      },
      {
        "word": "角落",
        "translation": "corner - 角 jiao3 (angle) 落 luo4 (fall)",
        "explanation": "This refers to a place where two walls meet."
      }
    ],
    [
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "Refers to Milo."
      },
      {
        "word": "小心翼翼地",
        "translation": "cautiously - 小心 xiao3 xin1 (careful) 翼 yi4 (wing) 翼 yi4 (wing) 地 de5 (adverbial particle)",
        "explanation": "This describes an action done with carefulness."
      },
      {
        "word": "拔出",
        "translation": "pulled out - 拔 ba2 (pull) 出 chu1 (out)",
        "explanation": "This indicates an action of taking something out."
      },
      {
        "word": "一些",
        "translation": "some - 一些 yi1 xie1 (some)",
        "explanation": "Indicates a small amount."
      },
      {
        "word": "填充物",
        "translation": "stuffing - 填 tian2 (fill)充 chong1 (fill) 物 wu4 (thing)",
        "explanation": "This refers to the material used to fill something."
      },
      {
        "word": "制作",
        "translation": "made - 制作 zhi4 zuo4 (make)",
        "explanation": "This means to create or construct."
      },
      {
        "word": "了",
        "translation": "(completed action marker) - 了 le5 (completed)",
        "explanation": "This indicates the action was finished."
      },
      {
        "word": "一个",
        "translation": "a - 一 yi1 (one) 个 ge4 (measure word)",
        "explanation": "This is a classifier for singular items."
      },
      {
        "word": "迷你",
        "translation": "mini - 迷 ni2 (confuse) 你 ni3 (you)",
        "explanation": "This describes something small."
      },
      {
        "word": "诱饵",
        "translation": "bait - 诱 you4 (lure) 饵 er3 (bait)",
        "explanation": "This is something used to attract."
      }
    ],
    [
      {
        "word": "它",
        "translation": "it - 它 ta1 (it)",
        "explanation": "Refers to the bait."
      },
      {
        "word": "是",
        "translation": "is - 是 shi4 (is)",
        "explanation": "This is a verb of being."
      },
      {
        "word": "一个",
        "translation": "a - 一 yi1 (one) 个 ge4 (measure word)",
        "explanation": "This indicates a singular item."
      },
      {
        "word": "完美",
        "translation": "perfect - 完 wan2 (complete) 美 mei3 (beautiful)",
        "explanation": "Describes something that is flawless."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de5 (of)",
        "explanation": "Shows possession."
      },
      {
        "word": "自我",
        "translation": "self - 自 zi4 (self) 我 wo3 (I)",
        "explanation": "Refers to one's own identity."
      },
      {
        "word": "复制品",
        "translation": "copy - 复制 fu4 zhi4 (duplicate) 品 pin3 (item)",
        "explanation": "This is an item made to be like another."
      },
      {
        "word": "只是",
        "translation": "just - 只 zhi3 (only) 是 shi4 (is)",
        "explanation": "This indicates a restriction."
      },
      {
        "word": "稍微",
        "translation": "slightly - 稍 shao1 (a bit) 微 wei1 (micro)",
        "explanation": "This means to a small extent."
      },
      {
        "word": "大一点",
        "translation": "a bit bigger - 大 da4 (big) 一点 yi1 dian3 (a little)",
        "explanation": "Describes a size comparison."
      },
      {
        "word": "而且",
        "translation": "and - 而 qie3 (and)",
        "explanation": "This is a conjunction used for addition."
      },
      {
        "word": "覆盖着",
        "translation": "covered with - 覆盖 fu4 gai4 (cover) 着 zhe5 (the state of)",
        "explanation": "This states something is covered."
      },
      {
        "word": "绒毛",
        "translation": "fuzz - 绒 rong2 (fluff) 毛 mao2 (hair)",
        "explanation": "This refers to the soft, fuzzy material."
      }
    ],
    [
      {
        "word": "夜幕",
        "translation": "nightfall - 夜 ye4 (night) 幕 mu4 (curtain)",
        "explanation": "The word '夜幕' refers to the time when night begins to darken."
      },
      {
        "word": "降临",
        "translation": "descends - 降 jiang4 (to descend) 临 lin2 (to arrive)",
        "explanation": "The word '降临' describes the arrival of night."
      },
      {
        "word": "时",
        "translation": "when - 时 shi2 (time)",
        "explanation": "This word indicates the time or moment something occurs."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米 mi3 (rice) 洛 luo4 (to descend)",
        "explanation": "'米洛' is a name, specifically the character's name."
      },
      {
        "word": "将",
        "translation": "will - 将 jiang1 (will)",
        "explanation": "The word indicates a future action."
      },
      {
        "word": "诱饵",
        "translation": "bait - 诱你 you4 (entice) 饵 er3 (bait)",
        "explanation": "This word refers to something used to attract or catch, like bait."
      },
      {
        "word": "放在",
        "translation": "put on - 放 fang4 (to put) 在 zai4 (to be at)",
        "explanation": "This phrase indicates the action of placing something somewhere."
      },
      {
        "word": "房间",
        "translation": "room - 房 fang2 (house) 间 jian1 (between)",
        "explanation": "This word refers to an enclosed space, like a room."
      },
      {
        "word": "的",
        "translation": "(’s) - 的 de5 (possessive particle)",
        "explanation": "A particle used to indicate possession."
      },
      {
        "word": "另一端",
        "translation": "the other end - 另 ling4 (another) 一 yi1 (one) 端 duan1 (end)",
        "explanation": "This phrase refers to a different side or end."
      }
    ],
    [
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "This word refers to a male character, Milo."
      },
      {
        "word": "轻推",
        "translation": "gently pushed - 轻 qing1 (lightly) 推 tui1 (to push)",
        "explanation": "This phrase describes the action of applying light pressure."
      },
      {
        "word": "了一下",
        "translation": "a little - 了 le (completed action) 一次 yi1 ci4 (one time)",
        "explanation": "This indicates that the action was done in a small way or for a brief moment."
      },
      {
        "word": "让",
        "translation": "make - 让 rang4 (to allow)",
        "explanation": "This word indicates causing something to happen."
      },
      {
        "word": "它",
        "translation": "it - 它 ta1 (it)",
        "explanation": "This word refers to the bait."
      },
      {
        "word": "看起来",
        "translation": "looks - 看 kan4 (to see) 起来 qi3 lai2 (to appear)",
        "explanation": "This phrase indicates the appearance or impression of something."
      },
      {
        "word": "在",
        "translation": "in - 在 zai4 (to exist at)",
        "explanation": "This word indicates being in a location."
      },
      {
        "word": "移动",
        "translation": "moving - 移动 yi2 dong4 (to move)",
        "explanation": "This word describes the action of changing position."
      }
    ],
    [
      {
        "word": "随后",
        "translation": "afterwards - 随 sui2 (following) 后 hou4 (after)",
        "explanation": "This word indicates what happens next or after the previous action."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "Refers to Milo."
      },
      {
        "word": "躲在",
        "translation": "hiding behind - 躲 duo3 (to hide) 在 zai4 (to be at)",
        "explanation": "This phrase describes the action of concealing oneself in a specific location."
      },
      {
        "word": "一壶茶",
        "translation": "a pot of tea - 一 yi1 (one) 壶 hu2 (pot) 茶 cha2 (tea)",
        "explanation": "This phrase indicates a container for tea."
      },
      {
        "word": "后",
        "translation": "behind - 后 hou4 (behind)",
        "explanation": "Indicates the position at the back of something."
      },
      {
        "word": "心中",
        "translation": "in heart - 心 xin1 (heart) 中 zhong1 (in)",
        "explanation": "This phrase describes thoughts or feelings that come from within oneself."
      },
      {
        "word": "充满",
        "translation": "filled with - 充 chong1 (to fill) 满 man3 (full)",
        "explanation": "Describes being full of something."
      },
      {
        "word": "期待",
        "translation": "expectation - 期 qi1 (period) 待 dai4 (to wait)",
        "explanation": "Refers to the feeling of looking forward to something."
      }
    ],
    [
      {
        "word": "果然",
        "translation": "as expected - 果 guo3 (fruit) 然 ran2 (thus)",
        "explanation": "This word indicates that something happened as predicted."
      },
      {
        "word": "不久后",
        "translation": "soon after - 不久 bu4 jiu3 (not long) 后 hou4 (after)",
        "explanation": "This phrase indicates that something happens in a short amount of time."
      },
      {
        "word": "威斯克先生",
        "translation": "Mr. Wesker - 威 wei1 (power) 斯 si1 (this) 克 ke4 (to conquer) 先生 xian1 sheng (mister)",
        "explanation": "This is the name of another character, Mr. Wesker."
      },
      {
        "word": "从",
        "translation": "from - 从 cong2 (from)",
        "explanation": "Indicates the origin or starting point of the action."
      },
      {
        "word": "睡梦中",
        "translation": "in dreams - 睡 shui4 (to sleep) 梦 meng4 (dream) 中 zhong1 (in)",
        "explanation": "Describes the state of being asleep."
      },
      {
        "word": "瞥见了",
        "translation": "caught a glimpse - 瞥 pie1 (to glance) 见 jian4 (to see) 了 le (completed action)",
        "explanation": "This phrase describes noticing something suddenly or briefly."
      },
      {
        "word": "那",
        "translation": "that - 那 na4 (that)",
        "explanation": "Refers to a specific thing or situation."
      },
      {
        "word": "一动",
        "translation": "a movement - 一 yi1 (one) 动 dong4 (movement)",
        "explanation": "Refers to a single instance of movement."
      }
    ],
    [
      {
        "word": "啊哈",
        "translation": "aha - 啊 ha (exclamation)",
        "explanation": "An exclamation indicating sudden realization or surprise."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "Refers to Mr. Wesker."
      },
      {
        "word": "想着",
        "translation": "thought of - 想 xiang3 (to think) 着 zhao4 (continuing action)",
        "explanation": "This indicates the action of thinking."
      },
      {
        "word": "伸着懒腰",
        "translation": "stretching - 伸 shen1 (to stretch) 懒 lan3 (lazy) 腰 yao1 (waist)",
        "explanation": "Describes the action of stretching one's body, often done when waking."
      },
      {
        "word": "打了个哈欠",
        "translation": "yawned - 打 da3 (to hit) 了 le (completed action) 个 ge4 (measure word) 哈欠 ha qian4 (yawn)",
        "explanation": "Describes the action of yawning, usually indicating sleepiness."
      },
      {
        "word": "我家",
        "translation": "my home - 我 wo3 (I) 家 jia1 (home)",
        "explanation": "Indicates possession of a home."
      },
      {
        "word": "来了",
        "translation": "came - 来 lai2 (to come) 了 le (completed action)",
        "explanation": "Describes the action of arriving."
      },
      {
        "word": "只",
        "translation": "a - 只 zhi3 (only)",
        "explanation": "A measure word used for animals or singular items."
      },
      {
        "word": "老鼠",
        "translation": "mouse - 老鼠 lao3 shu3 (mouse)",
        "explanation": "Refers to the small rodent."
      }
    ],
    [
      {
        "word": "威斯克",
        "translation": "Mr. Whiskers - 威 (wei1, to maintain) 斯 (si1, to weave) 克 (ke4, to conquer)",
        "explanation": "This is the name of a character, Mr. Whiskers."
      },
      {
        "word": "先生",
        "translation": "Mr. - 先 (xian1, before) 生 (sheng1, to be born)",
        "explanation": "This is a title used to address a man."
      },
      {
        "word": "敏捷",
        "translation": "agile - 敏 (min3, quick) 捷 (jie2, rapid)",
        "explanation": "Describes how Mr. Whiskers moves very quickly."
      },
      {
        "word": "迅速",
        "translation": "swiftly - 迅 (xun4, fast) 速 (su4, speed)",
        "explanation": "Another word describing how fast Mr. Whiskers is."
      },
      {
        "word": "朝",
        "translation": "toward - 朝 (chao2, toward)",
        "explanation": "Indicates the direction Mr. Whiskers is moving."
      },
      {
        "word": "诱饵",
        "translation": "bait - 诱 (you4, to lure) 饵 (er3, food)",
        "explanation": "Refers to the object Mr. Whiskers is chasing."
      },
      {
        "word": "扑去",
        "translation": "leapt towards - 扑 (pu1, to pounce) 去 (qu4, to go)",
        "explanation": "Describes the action of Mr. Whiskers jumping or pouncing."
      },
      {
        "word": "速度",
        "translation": "speed - 速 (su4, speed) 度 (du4, degree)",
        "explanation": "Refers to how fast Mr. Whiskers is moving."
      },
      {
        "word": "让",
        "translation": "make - 让 (rang4, to allow)",
        "explanation": "Means to cause someone (the mice) to feel a certain way."
      },
      {
        "word": "任何",
        "translation": "any - 任何 (ren4 he2, any)",
        "explanation": "Refers to all types of mice."
      },
      {
        "word": "老鼠",
        "translation": "mice - 老 (lao3, old) 鼠 (shu3, rat)",
        "explanation": "Refers to the creatures Mr. Whiskers is causing fear in."
      },
      {
        "word": "都",
        "translation": "all - 都 (dou1, all)",
        "explanation": "Indicates that it applies to every mouse."
      },
      {
        "word": "感到",
        "translation": "feel - 感 (gan3, to feel) 到 (dao4, to reach)",
        "explanation": "Describes what the mice experience."
      },
      {
        "word": "心惊胆战",
        "translation": "fearful - 心惊 (xin1 jing1, heart frightened) 胆战 (dan3 zhan4, gall trembling)",
        "explanation": "A phrase describing a strong sense of fear."
      }
    ],
    [
      {
        "word": "但",
        "translation": "but - 但 (dan4, but)",
        "explanation": "Indicates a contrast or exception to what was previously stated."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米 (mi3, rice) 洛 (luo4, flowing)",
        "explanation": "This is the name of another character."
      },
      {
        "word": "早已",
        "translation": "already - 早 (zao3, early) 已 (yi3, already)",
        "explanation": "Indicates that something has happened before now."
      },
      {
        "word": "计划得当",
        "translation": "planned well - 计划 (ji4 hua4, to plan) 得当 (de2 dang4, appropriate)",
        "explanation": "Describes how Milo has made a good plan."
      }
    ],
    [
      {
        "word": "当",
        "translation": "when - 当 (dang1, when)",
        "explanation": "Indicates a specific time."
      },
      {
        "word": "威斯克",
        "translation": "Mr. Whiskers - 威 (wei1, to maintain) 斯 (si1, to weave) 克 (ke4, to conquer)",
        "explanation": "Same character as before."
      },
      {
        "word": "先生",
        "translation": "Mr. - 先 (xian1, before) 生 (sheng1, to be born)",
        "explanation": "Same title as before."
      },
      {
        "word": "追逐",
        "translation": "chasing - 追 (zhui1, to chase) 逐 (zhu2, to pursue)",
        "explanation": "Describes what Mr. Whiskers is doing."
      },
      {
        "word": "那团",
        "translation": "the ball of - 那 (na4, that) 团 (tuan2, ball)",
        "explanation": "Refers to the object Mr. Whiskers is chasing."
      },
      {
        "word": "毛绒球",
        "translation": "fuzzy ball - 毛绒 (mao2 rong2, furry) 球 (qiu2, ball)",
        "explanation": "Describes the object that looks like a ball of fluff."
      },
      {
        "word": "时",
        "translation": "time - 时 (shi2, time)",
        "explanation": "Indicates a moment."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米 (mi3, rice) 洛 (luo4, flowing)",
        "explanation": "Same character as before."
      },
      {
        "word": "抓住",
        "translation": "seized - 抓 (zhua1, to grab) 住 (zhu4, to hold)",
        "explanation": "Describes what Milo did at that moment."
      },
      {
        "word": "了",
        "translation": "completed action marker - 了 (le)",
        "explanation": "Indicates completion of an action."
      },
      {
        "word": "机会",
        "translation": "opportunity - 机 (ji1, machine) 会 (hui4, meeting)",
        "explanation": "Refers to a chance to do something."
      }
    ],
    [
      {
        "word": "他",
        "translation": "he - 他 (ta1, he)",
        "explanation": "Refers to Milo."
      },
      {
        "word": "飞快",
        "translation": "quickly - 飞快 (fei1 kuai4, flying fast)",
        "explanation": "Describes how rapidly Milo moves."
      },
      {
        "word": "穿过",
        "translation": "ran through - 穿 (chuan1, to pass through) 过 (guo4, to cross)",
        "explanation": "Describes the action of moving through."
      },
      {
        "word": "厨房",
        "translation": "kitchen - 厨 (chu2, cook) 房 (fang2, room)",
        "explanation": "The location Milo is moving in."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 (de)",
        "explanation": "Used to link to the next word."
      },
      {
        "word": "台面",
        "translation": "countertop - 台 (tai2, table) 面 (mian4, surface)",
        "explanation": "Refers to the surface of the kitchen."
      },
      {
        "word": "眼中",
        "translation": "in his eyes - 眼 (yan3, eye) 中 (zhong1, middle)",
        "explanation": "Indicates where Milo's focus is."
      },
      {
        "word": "紧盯",
        "translation": "staring - 紧 (jin3, tight) 盯 (ding1, to stare)",
        "explanation": "Describes how Milo is looking at something."
      },
      {
        "word": "着",
        "translation": "(indicates continuing action) - 着 (zhao4)",
        "explanation": "Indicates that Milo is actively looking."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶 (nai3, milk) 酪 (lao4, curd)",
        "explanation": "The food that Milo is focusing on."
      }
    ],
    [
      {
        "word": "当",
        "translation": "when - 当 (dang1, when)",
        "explanation": "Introduces the timing of an event."
      },
      {
        "word": "他",
        "translation": "he - 他 (ta1, he)",
        "explanation": "Refers back to Milo."
      },
      {
        "word": "到达",
        "translation": "arrived - 到 (dao4, to arrive) 达 (da2, to reach)",
        "explanation": "Describes Milo reaching a place."
      },
      {
        "word": "架子",
        "translation": "shelf - 架 (jia4, frame) 子 (zi3, object)",
        "explanation": "Refers to the place where the cheese is located."
      },
      {
        "word": "时",
        "translation": "when - 时 (shi2, time)",
        "explanation": "Indicates a specific time."
      },
      {
        "word": "图书馆",
        "translation": "library - 图书 (tu2 shu1, books) 馆 (guan3, building)",
        "explanation": "Place where many books are kept."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 (de)",
        "explanation": "Links to the next word."
      },
      {
        "word": "钟声",
        "translation": "bell sound - 钟 (zhong1, bell) 声 (sheng1, sound)",
        "explanation": "Refers to the sound made by the clock."
      },
      {
        "word": "在",
        "translation": "at - 在 (zai4, at)",
        "explanation": "Indicates the location."
      },
      {
        "word": "午夜",
        "translation": "midnight - 半夜 (ban4 ye4, midnight)",
        "explanation": "Refers to the specific time of night."
      },
      {
        "word": "敲响",
        "translation": "struck - 敲 (qiao1, to strike) 响 (xiang3, to ring)",
        "explanation": "Describes the action of the clock making sound."
      },
      {
        "word": "带着",
        "translation": "carrying - 带 (dai4, to carry) 着 (zhao4, to hold)",
        "explanation": "Indicates that something is accompanying the sound."
      },
      {
        "word": "优美",
        "translation": "beautiful - 优 (you1, excellent) 美 (mei3, beautiful)",
        "explanation": "Describes the quality of the sound."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 (de)",
        "explanation": "Links to the next word."
      },
      {
        "word": "音色",
        "translation": "tone - 音 (yin1, sound) 色 (se4, color)",
        "explanation": "The character of the sound made."
      },
      {
        "word": "在",
        "translation": "in - 在 (zai4, in)",
        "explanation": "Indicates location."
      },
      {
        "word": "房间",
        "translation": "room - 房 (fang2, house) 间 (jian1, interval)",
        "explanation": "Where the bell sound is heard."
      },
      {
        "word": "内",
        "translation": "inside - 内 (nei4, inside)",
        "explanation": "Refers to being within a certain space."
      },
      {
        "word": "回荡",
        "translation": "echoing - 回 (hui2, to return) 蕩 (dang4, to wave)",
        "explanation": "Describes the sound bouncing around."
      }
    ],
    [
      {
        "word": "这个",
        "translation": "this - 这 zhe4 (this) 个 ge4 (measure word)",
        "explanation": "'this' refers to something being indicated."
      },
      {
        "word": "时刻",
        "translation": "moment - 时刻 shi2ke4 (moment)",
        "explanation": "'moment' refers to a specific time."
      },
      {
        "word": "与",
        "translation": "with - 与 yu3 (with)",
        "explanation": "'with' connects two items."
      },
      {
        "word": "威斯克",
        "translation": "Wesker - 威斯克 Wei1sike1",
        "explanation": "'Wesker' is a proper noun, referring to a person."
      },
      {
        "word": "先生",
        "translation": "Mr. - 先 xian1 (first) 生 sheng1 (born)",
        "explanation": "'Mr.' is a formal title for a man."
      },
      {
        "word": "抡打",
        "translation": "swung - 抡 lun1 (to swing) 打 da3 (to hit)",
        "explanation": "'swung' describes how he uses the bait."
      },
      {
        "word": "诱饵",
        "translation": "bait - 诱 yòu (to lure) 饵 ěr (bait)",
        "explanation": "'bait' refers to something used to attract."
      },
      {
        "word": "制造",
        "translation": "created - 制造 zhi4zao4 (to create)",
        "explanation": "'created' indicates the action of making something."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de (structural particle)",
        "explanation": "'of', indicates possession."
      },
      {
        "word": "骚动",
        "translation": "commotion - 骚动 sao1dong4 (commotion)",
        "explanation": "'commotion' refers to a lot of noise or activity."
      },
      {
        "word": "完美",
        "translation": "perfectly - 完美 wan2mei3 (perfect)",
        "explanation": "'perfectly' describes how well things are combined."
      },
      {
        "word": "融合",
        "translation": "integrated - 融合 rong2he2 (to merge)",
        "explanation": "'integrated' means combined into one."
      },
      {
        "word": "令",
        "translation": "made - 令 ling4 (to cause)",
        "explanation": "'made' indicates something that caused an effect."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "'he' is a pronoun referring to a male."
      },
      {
        "word": "觉得",
        "translation": "felt - 觉得 jue2de (to feel)",
        "explanation": "'felt' expresses an emotional or physical sensation."
      },
      {
        "word": "自己",
        "translation": "oneself - 自 zi4 (self) 己 ji3 (oneself)",
        "explanation": "'oneself' refers to the person doing the action."
      },
      {
        "word": "终于",
        "translation": "finally - 终于 zhong1yu2 (finally)",
        "explanation": "'finally' indicates the end of a wait."
      },
      {
        "word": "找到了",
        "translation": "found - 找到 zhao3dao4 (to find) 了 le (completed action)",
        "explanation": "'found' indicates a successful search."
      },
      {
        "word": "晚餐",
        "translation": "dinner - 晚餐 wan3can1 (dinner)",
        "explanation": "'dinner' is the meal eaten in the evening."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de (structural particle)",
        "explanation": "used to connect adjectives to nouns."
      },
      {
        "word": "目标",
        "translation": "target - 目 mu4 (eye) 标 biao1 (mark/target)",
        "explanation": "'target' refers to what he aims for."
      }
    ],
    [
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3luo4",
        "explanation": "'Milo' is a proper noun referring to a character."
      },
      {
        "word": "迅速",
        "translation": "quickly - 迅速 xun4su4 (quickly)",
        "explanation": "'quickly' describes the speed of an action."
      },
      {
        "word": "抓起",
        "translation": "grabbed - 抓起 zhua1qi3 (to grab)",
        "explanation": "'grabbed' means to take something suddenly."
      },
      {
        "word": "一块",
        "translation": "a piece - 一 yi1 (one) 块 kuai4 (piece)",
        "explanation": "'a piece' indicates a single portion."
      },
      {
        "word": "切达奶酪",
        "translation": "cheddar cheese - 切达 qie1da2 (cheddar) 奶酪 nai3lao4 (cheese)",
        "explanation": "'cheddar cheese' is a type of cheese."
      },
      {
        "word": "远比",
        "translation": "far more - 远 yuan3 (far) 比 bi3 (compare)",
        "explanation": "'far more' indicates a significant difference."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "pronoun referring to Milo."
      },
      {
        "word": "预期",
        "translation": "expected - 预期 yu4qi1 (to expect)",
        "explanation": "'expected' means what he thought would happen."
      },
      {
        "word": "的",
        "translation": "(possessive particle) - 的 de (structural particle)",
        "explanation": "used to connect adjectives to nouns."
      },
      {
        "word": "沉重",
        "translation": "heavy - 沉重 chen2zhong4 (heavy)",
        "explanation": "'heavy' describes the weight of the cheese."
      },
      {
        "word": "但",
        "translation": "but - 但 dan4 (but)",
        "explanation": "'but' introduces a contrast."
      },
      {
        "word": "美味",
        "translation": "delicious - 美味 mei3wei4 (delicious)",
        "explanation": "'delicious' describes the taste."
      },
      {
        "word": "得",
        "translation": "(adverbial marker) - 得 de (adverbial particle)",
        "explanation": "used to indicate degree of quality."
      },
      {
        "word": "令人",
        "translation": "makes people - 令人 ling4ren2 (to make people feel)",
        "explanation": "'makes people' indicates how it affects others."
      },
      {
        "word": "无法",
        "translation": "unable - 无法 wu2fa3 (unable)",
        "explanation": "'unable' indicates lack of ability."
      },
      {
        "word": "舍弃",
        "translation": "abandon - 舍弃 she3qi4 (to abandon)",
        "explanation": "'abandon' means to give up possession."
      }
    ],
    [
      {
        "word": "抓着",
        "translation": "holding - 抓 zhua1 (to grab) 着 zhe (the aspect particle)",
        "explanation": "'holding' means he is carrying something."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶酪 nai3lao4 (cheese)",
        "explanation": "'cheese' is the food he is holding."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3luo4",
        "explanation": "proper noun referring to the character."
      },
      {
        "word": "急速",
        "translation": "quickly - 急速 ji2su4 (quickly)",
        "explanation": "'quickly' refers to the speed of his movement."
      },
      {
        "word": "往",
        "translation": "towards - 往 wang3 (towards)",
        "explanation": "'towards' indicates the direction of movement."
      },
      {
        "word": "墙边",
        "translation": "the wall side - 墙 qiang2 (wall) 边 bian1 (side)",
        "explanation": "'the wall side' indicates where he is running."
      },
      {
        "word": "跑去",
        "translation": "ran - 跑去 pao3qu4 (to run)",
        "explanation": "'ran' describes his action of moving fast."
      },
      {
        "word": "正好",
        "translation": "just right - 正好 zheng4hao3 (just right)",
        "explanation": "'just right' means perfectly timed."
      },
      {
        "word": "看到",
        "translation": "saw - 看到 kan4dao4 (to see)",
        "explanation": "'saw' indicates the action of perceiving."
      },
      {
        "word": "威斯克",
        "translation": "Wesker - 威斯克 Wei1sike1",
        "explanation": "proper noun, a character's name."
      },
      {
        "word": "先生",
        "translation": "Mr. - 先 xian1 (first) 生 sheng1 (born)",
        "explanation": "formal title for a man."
      },
      {
        "word": "意识到",
        "translation": "realized - 意识到 yi4shi2dao4 (to realize)",
        "explanation": "'realized' means to become aware of something."
      },
      {
        "word": "自己",
        "translation": "oneself - 自 zi4 (self) 己 ji3 (oneself)",
        "explanation": "'oneself' refers to the subject's own identity."
      },
      {
        "word": "被骗了",
        "translation": "was deceived - 被 bei4 (by) 骗 pian4 (to deceive) 了 le (completed action)",
        "explanation": "'was deceived' indicates a past experience."
      }
    ],
    [
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3luo4",
        "explanation": "proper noun referring to the character."
      },
      {
        "word": "及时",
        "translation": "in time - 及时 ji2shi2 (in time)",
        "explanation": "'in time' means arriving at the right moment."
      },
      {
        "word": "回到",
        "translation": "returned - 回到 hui2dao4 (to return)",
        "explanation": "'returned' describes the action of going back."
      },
      {
        "word": "他的",
        "translation": "his - 他 ta1 (he) 的 de (possessive particle)",
        "explanation": "'his' indicates ownership."
      },
      {
        "word": "洞口",
        "translation": "den - 洞口 dong4kou3 (den opening)",
        "explanation": "'den' is a place where Milo stays."
      },
      {
        "word": "听到",
        "translation": "heard - 听到 ting1dao4 (to hear)",
        "explanation": "'heard' describes the action of listening."
      },
      {
        "word": "威斯克",
        "translation": "Wesker - 威斯克 Wei1sike1",
        "explanation": "proper noun, a character's name."
      },
      {
        "word": "先生",
        "translation": "Mr. - 先 xian1 (first) 生 sheng1 (born)",
        "explanation": "formal title for a man."
      },
      {
        "word": "发出",
        "translation": "let out - 发出 fa1chu1 (to let out)",
        "explanation": "'let out' describes making a sound."
      },
      {
        "word": "困惑的",
        "translation": "confusing - 困惑 kun4huo4 (confused) 的 de (structural particle)",
        "explanation": "'confusing' describes the nature of the sound."
      },
      {
        "word": "喵声",
        "translation": "meow - 喵声 miao1sheng1 (meow sound)",
        "explanation": "'meow' is the sound a cat makes."
      },
      {
        "word": "与",
        "translation": "and - 与 yu3 (and)",
        "explanation": "'and' connects two items."
      },
      {
        "word": "他自己",
        "translation": "himself - 他 ta1 (he) 自己 zi4ji3 (himself)",
        "explanation": "'himself' refers to Milo."
      },
      {
        "word": "骄傲的",
        "translation": "proud - 骄傲 jiao1ao4 (proud) 的 de (structural particle)",
        "explanation": "'proud' describes one’s feeling."
      },
      {
        "word": "吱吱声",
        "translation": "chirp - 吱吱声 zhi1zhi1sheng1 (chirp sound)",
        "explanation": "'chirp' is the sound he makes."
      },
      {
        "word": "交融在一起",
        "translation": "merged together - 交融 jiao1rong2 (to merge) 在 zai4 (at) 一起 yi4qi3 (together)",
        "explanation": "'merged together' describes how the sounds combine."
      }
    ],
    [
      {
        "word": "你可以",
        "translation": "you can - 你 ni3 (you) 可以 ke3yi3 (can)",
        "explanation": "'you can' indicates permission or ability."
      },
      {
        "word": "守住",
        "translation": "hold onto - 守住 shou3zhu4 (to guard)",
        "explanation": "'hold onto' means to keep possession."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶酪 nai3lao4 (cheese)",
        "explanation": "'cheese' is the food being discussed."
      },
      {
        "word": "但",
        "translation": "but - 但 dan4 (but)",
        "explanation": "'but' indicates a contrast."
      },
      {
        "word": "今晚",
        "translation": "tonight - 今 jīn (today) 晚 wǎn (evening)",
        "explanation": "'tonight' refers to the current night."
      },
      {
        "word": "我却要",
        "translation": "I will - 我 wǒ (I) 却 què (however) 要 yào (want)",
        "explanation": "'I will' indicates future intention."
      },
      {
        "word": "享用",
        "translation": "enjoy - 享用 xiǎngyòng (to enjoy)",
        "explanation": "'enjoy' means to take pleasure in something."
      },
      {
        "word": "！",
        "translation": "(exclamation mark) - ！ ! (exclamation)",
        "explanation": "used to show excitement."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3luo4",
        "explanation": "proper noun referring to the character."
      },
      {
        "word": "骄傲地",
        "translation": "proudly - 骄傲地 jiao1ao4de (proudly)",
        "explanation": "'proudly' describes how he speaks."
      },
      {
        "word": "尖叫",
        "translation": "screamed - 尖叫 jian1jiao4 (to scream)",
        "explanation": "'screamed' indicates the action of shouting."
      }
    ],
    [
      {
        "word": "随着",
        "translation": "with - 随 su2 (follow) 着 zhe (indicates continuous tense)",
        "explanation": "This indicates a condition or situation occurring simultaneously or as a result of another."
      },
      {
        "word": "黎明",
        "translation": "dawn - 黎明 li2 ming2 (dawn)",
        "explanation": "This refers to the time of day when the sun begins to rise."
      },
      {
        "word": "的",
        "translation": "(possessive or descriptive particle) - 的 de",
        "explanation": "This particle is used to indicate possession or attribute."
      },
      {
        "word": "阳光",
        "translation": "sunlight - 阳光 yang2 guang1 (sunlight)",
        "explanation": "This refers to the light that comes from the sun."
      },
      {
        "word": "洒",
        "translation": "sprinkled - 洒 sa3 (to sprinkle)",
        "explanation": "This describes the action of the sunlight spreading or casting over."
      },
      {
        "word": "入",
        "translation": "into - 入 ru4 (to enter)",
        "explanation": "This indicates direction or movement towards something."
      },
      {
        "word": "小屋",
        "translation": "cottage - 小屋 xiao3 wu1 (small house)",
        "explanation": "This is a small type of house."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3 Luo4 (name)",
        "explanation": "This is the name of the main character."
      },
      {
        "word": "品味",
        "translation": "savoring - 品味 pin3 wei4 (to taste)",
        "explanation": "Describes the action of enjoying or tasting something carefully."
      },
      {
        "word": "着",
        "translation": "(progressive aspect marker) - 着 zhe",
        "explanation": "This indicates that the action is currently ongoing."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "This pronoun refers to Milo."
      },
      {
        "word": "渴望",
        "translation": "longed for - 渴望 ke3 wang4 (to yearn)",
        "explanation": "This describes a strong desire or wish."
      },
      {
        "word": "已久",
        "translation": "long time - 已久 yi3 jiu3 (a long time)",
        "explanation": "This indicates that the longing has been present for a significant amount of time."
      },
      {
        "word": "的",
        "translation": "(possessive or descriptive particle) - 的 de",
        "explanation": "This indicates possession or attribute."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶酪 nai3 lao4 (cheese)",
        "explanation": "This refers to the dairy product that Milo desires."
      },
      {
        "word": "的",
        "translation": "(possessive or descriptive particle) - 的 de",
        "explanation": "This indicates possession or attribute."
      },
      {
        "word": "第一口",
        "translation": "first bite - 第一口 di4 yi1 kou3 (the first bite)",
        "explanation": "This refers to the initial tasting of the cheese."
      }
    ],
    [
      {
        "word": "这",
        "translation": "this - 这 zhe4 (this)",
        "explanation": "Refers to something close in proximity."
      },
      {
        "word": "不仅仅",
        "translation": "not only - 不仅仅 bu4 jin3 jin3 (not only)",
        "explanation": "This indicates that there is more to something than what is mentioned."
      },
      {
        "word": "是",
        "translation": "is - 是 shi4 (is)",
        "explanation": "This is a linking verb that connects the subject and the predicate."
      },
      {
        "word": "一顿饭",
        "translation": "a meal - 一顿饭 yi1 dun4 fan4 (a meal)",
        "explanation": "This refers to food that is eaten at one time."
      },
      {
        "word": "而是",
        "translation": "but - 而是 er2 shi4 (but)",
        "explanation": "This is used to contrast the previous statement."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "This pronoun refers to Milo."
      },
      {
        "word": "机智",
        "translation": "cleverness - 机智 ji1 zhi4 (cleverness)",
        "explanation": "This refers to the quality of being witty or intelligent."
      },
      {
        "word": "的",
        "translation": "(possessive or descriptive particle) - 的 de",
        "explanation": "This indicates possession or attribute."
      },
      {
        "word": "证明",
        "translation": "proof - 证明 zheng4 ming2 (proof)",
        "explanation": "This refers to evidence or an indication that something is true."
      }
    ],
    [
      {
        "word": "这块",
        "translation": "this piece - 这块 zhe4 kuai4 (this piece)",
        "explanation": "Indicates a specific piece of cheese."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶酪 nai3 lao4 (cheese)",
        "explanation": "This refers to the dairy product."
      },
      {
        "word": "丰富",
        "translation": "rich - 丰厚 feng1 fu4 (rich)",
        "explanation": "Describes something that has a lot of qualities, flavors, or content."
      },
      {
        "word": "美味",
        "translation": "delicious - 美味 mei3 wei4 (delicious)",
        "explanation": "Describes the cheese as having a great taste."
      },
      {
        "word": "他",
        "translation": "he - 他 ta1 (he)",
        "explanation": "This pronoun refers to Milo."
      },
      {
        "word": "情不自禁",
        "translation": "unable to restrain himself - 情不自禁 qing2 bu4 zi4 jin1 (unable to hold back feelings)",
        "explanation": "This means he cannot help but show his feelings."
      },
      {
        "word": "地",
        "translation": "(adverbial particle) - 地 de",
        "explanation": "This particle is used to form an adverb."
      },
      {
        "word": "微笑",
        "translation": "smile - 微笑 wei1 xiao4 (smile)",
        "explanation": "Describes the action of smiling, expressing happiness."
      }
    ],
    [
      {
        "word": "从那天起",
        "translation": "from that day on - 从那天起 cong2 na4 tian1 qi3 (from that day on)",
        "explanation": "Indicates the start time of an action."
      },
      {
        "word": "米洛",
        "translation": "Milo - 米洛 Mi3 Luo4 (name)",
        "explanation": "This is the name of the main character."
      },
      {
        "word": "继续",
        "translation": "continued - 继续 ji4 xu4 (to continue)",
        "explanation": "Indicates that he kept doing an action."
      },
      {
        "word": "用",
        "translation": "with - 用 yong4 (to use)",
        "explanation": "Indicates the means by which something is done."
      },
      {
        "word": "他的",
        "translation": "his - 他的 ta1 de5 (his)",
        "explanation": "This shows possession belonging to Milo."
      },
      {
        "word": "聪明",
        "translation": "cleverness - 聪明 cong1 ming2 (clever)",
        "explanation": "Refers to his intelligence or resourcefulness."
      },
      {
        "word": "把玩",
        "translation": "to play with - 把玩 ba3 wan2 (to play or handle)",
        "explanation": "This means to handle or enjoy something in a playful way."
      },
      {
        "word": "奶酪",
        "translation": "cheese - 奶酪 nai3 lao4 (cheese)",
        "explanation": "This refers to the dairy product."
      },
      {
        "word": "的",
        "translation": "(possessive or descriptive particle) - 的 de",
        "explanation": "This indicates possession or attribute."
      },
      {
        "word": "储藏",
        "translation": "storage - 储藏 chu3 cang2 (storage)",
        "explanation": "This refers to where the cheese is kept."
      },
      {
        "word": "，",
        "translation": ", - ， ,",
        "explanation": "This comma separates parts of the sentence."
      },
      {
        "word": "令",
        "translation": "causing - 令 ling4 (to cause)",
        "explanation": "This indicates that an action results in something."
      },
      {
        "word": "威斯克先生",
        "translation": "Mr. Whiskers - 威斯克先生 Wei1 si1 ke4 xian1 sheng1 (Mr. Whiskers)",
        "explanation": "This is the name of the character who is Milos' opponent."
      },
      {
        "word": "苦恼",
        "translation": "distressed - 苦恼 ku3 nao3 (distressed)",
        "explanation": "This describes Mr. Whiskers' state of worry or unhappiness."
      },
      {
        "word": "不已",
        "translation": "endlessly - 不已 bu4 yi3 (without stopping)",
        "explanation": "Indicates that something continues without cease."
      },
      {
        "word": "，",
        "translation": ", - ， ,",
        "explanation": "This comma separates parts of the sentence."
      },
      {
        "word": "后者",
        "translation": "the latter - 后者 hou4 zhe3 (the latter)",
        "explanation": "This refers back to Mr. Whiskers."
      },
      {
        "word": "只能",
        "translation": "can only - 只能 zhi3 neng2 (can only)",
        "explanation": "This indicates limitation on what he is able to do."
      },
      {
        "word": "在旁",
        "translation": "on the side - 在旁 zai4 pang2 (on the side)",
        "explanation": "This means nearby, observing."
      },
      {
        "word": "潜伏",
        "translation": "lurking - 潜伏 qian2 fu2 (to lurk)",
        "explanation": "This describes hiding or waiting secretly."
      },
      {
        "word": "，",
        "translation": ", - ， ,",
        "explanation": "This comma separates parts of the sentence."
      },
      {
        "word": "眼睁睁",
        "translation": "staring - 眼睁睁 yan3 zheng1 zheng1 (wide-eyed)",
        "explanation": "This describes a state of being unable to act while observing."
      },
      {
        "word": "地",
        "translation": "(adverbial particle) - 地 de",
        "explanation": "This particle is used to form an adverb."
      },
      {
        "word": "看着",
        "translation": "watching - 看着 kan4 zhe5 (to watch)",
        "explanation": "Describes the action of watching something."
      },
      {
        "word": "这只",
        "translation": "this little - 这只 zhe4 zhi1 (this little)",
        "explanation": "Describes the mouse Milo."
      },
      {
        "word": "小老鼠",
        "translation": "little mouse - 小老鼠 xiao3 lao3 shu3 (little mouse)",
        "explanation": "Refers to the character Milo, who is a mouse."
      },
      {
        "word": "成为",
        "translation": "become - 成为 cheng2 wei2 (to become)",
        "explanation": "Describes the transformation into something."
      },
      {
        "word": "小屋里",
        "translation": "in the cottage - 小屋里 xiao3 wu1 li3 (inside the cottage)",
        "explanation": "This indicates location inside the cottage."
      },
      {
        "word": "生物",
        "translation": "creature - 生物 sheng1 wu4 (creature)",
        "explanation": "This refers to a living being."
      },
      {
        "word": "中的",
        "translation": "among - 中的 zhong1 de (among)",
        "explanation": "Indicates being part of a group."
      },
      {
        "word": "传奇",
        "translation": "legend - 传奇 chuan2 qi2 (legend)",
        "explanation": "This describes something famous or well-known."
      }
    ]
  ]
}